{
    "format": "layers-model",
    "generatedBy": "keras v2.4.0",
    "convertedBy": "TensorFlow.js Converter v2.7.0",
    "modelTopology": {
        "keras_version": "2.4.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Functional",
            "config": {
                "name": "functional_3",
                "layers": [{
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [null, 13],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "input_2"
                    },
                    "name": "input_2",
                    "inbound_nodes": []
                }, {
                    "class_name": "Embedding",
                    "config": {
                        "name": "embedding_1",
                        "trainable": true,
                        "batch_input_shape": [null, null],
                        "dtype": "float32",
                        "input_dim": 5327,
                        "output_dim": 100,
                        "embeddings_initializer": {
                            "class_name": "RandomUniform",
                            "config": {
                                "minval": -0.05,
                                "maxval": 0.05,
                                "seed": null
                            }
                        },
                        "embeddings_regularizer": null,
                        "activity_regularizer": null,
                        "embeddings_constraint": null,
                        "mask_zero": false,
                        "input_length": null
                    },
                    "name": "embedding_1",
                    "inbound_nodes": [
                        [
                            ["input_2", 0, 0, {}]
                        ]
                    ]
                }, {
                    "class_name": "LSTM",
                    "config": {
                        "name": "lstm_1",
                        "trainable": true,
                        "dtype": "float32",
                        "return_sequences": true,
                        "return_state": false,
                        "go_backwards": false,
                        "stateful": false,
                        "unroll": false,
                        "time_major": false,
                        "units": 512,
                        "activation": "tanh",
                        "recurrent_activation": "sigmoid",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "recurrent_initializer": {
                            "class_name": "Orthogonal",
                            "config": {
                                "gain": 1.0,
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "unit_forget_bias": true,
                        "kernel_regularizer": null,
                        "recurrent_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "recurrent_constraint": null,
                        "bias_constraint": null,
                        "dropout": 0.0,
                        "recurrent_dropout": 0.0,
                        "implementation": 2
                    },
                    "name": "lstm_1",
                    "inbound_nodes": [
                        [
                            ["embedding_1", 0, 0, {}]
                        ]
                    ]
                }, {
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout_1",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.2,
                        "noise_shape": null,
                        "seed": null
                    },
                    "name": "dropout_1",
                    "inbound_nodes": [
                        [
                            ["lstm_1", 0, 0, {}]
                        ]
                    ]
                }, {
                    "class_name": "GlobalMaxPooling1D",
                    "config": {
                        "name": "global_max_pooling1d_1",
                        "trainable": true,
                        "dtype": "float32",
                        "data_format": "channels_last"
                    },
                    "name": "global_max_pooling1d_1",
                    "inbound_nodes": [
                        [
                            ["dropout_1", 0, 0, {}]
                        ]
                    ]
                }, {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_2",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 256,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "name": "dense_2",
                    "inbound_nodes": [
                        [
                            ["global_max_pooling1d_1", 0, 0, {}]
                        ]
                    ]
                }, {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_3",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 5327,
                        "activation": "softmax",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "name": "dense_3",
                    "inbound_nodes": [
                        [
                            ["dense_2", 0, 0, {}]
                        ]
                    ]
                }],
                "input_layers": [
                    ["input_2", 0, 0]
                ],
                "output_layers": [
                    ["dense_3", 0, 0]
                ]
            }
        },
        "training_config": {
            "loss": "categorical_crossentropy",
            "metrics": ["accuracy"],
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "Adam",
                    "learning_rate": 0.001,
                    "decay": 0.0,
                    "beta_1": 0.9,
                    "beta_2": 0.999,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [{
        "paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"],
        "weights": [{
            "name": "dense_2/kernel",
            "shape": [512, 256],
            "dtype": "float32"
        }, {
            "name": "dense_2/bias",
            "shape": [256],
            "dtype": "float32"
        }, {
            "name": "dense_3/kernel",
            "shape": [256, 5327],
            "dtype": "float32"
        }, {
            "name": "dense_3/bias",
            "shape": [5327],
            "dtype": "float32"
        }, {
            "name": "embedding_1/embeddings",
            "shape": [5327, 100],
            "dtype": "float32"
        }, {
            "name": "lstm_1/lstm_cell_1/kernel",
            "shape": [100, 2048],
            "dtype": "float32"
        }, {
            "name": "lstm_1/lstm_cell_1/recurrent_kernel",
            "shape": [512, 2048],
            "dtype": "float32"
        }, {
            "name": "lstm_1/lstm_cell_1/bias",
            "shape": [2048],
            "dtype": "float32"
        }]
    }]
}